GetFamilyPointLocations Method
 Returns the Point Locations for the Family Symbol.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2011
 Syntax
  C#
public IList<FamilyPointLocation> GetFamilyPointLocations()
  Visual Basic
Public Function GetFamilyPointLocations As IList(Of FamilyPointLocation)
  Visual C++
public:
IList<FamilyPointLocation^>^ GetFamilyPointLocations()
 Remarks
 If a family symbol has point references then their locations are returned by this method, otherwise an empty collection is returned. Examples of FamilySymbol objects that contain point location are Panels and Flexible Components.
 See Also
  FamilySymbol Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →